In [22]:
import pandas as pd
import numpy as np

df = pd.read_csv("people-100.csv")
df

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
0,1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
1,2,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,214.112.6044x4913,1910-03-24,Phytotherapist
2,3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath
3,4,A31Bee3c201ef58,Yesenia,Martinez,Male,kaitlinkaiser@example.com,584.094.6111,2017-08-03,Market researcher
4,5,1bA7A3dc874da3c,Lori,Todd,Male,buchananmanuel@example.net,689-207-3558x7233,1938-12-01,Veterinary surgeon
...,...,...,...,...,...,...,...,...,...
95,96,5eFda7caAeB260E,Dennis,Barnes,Female,bmartin@example.org,001-095-524-2112x257,1954-07-30,Software engineer
96,97,CCbFce93d3720bE,Steve,Patterson,Female,latasha46@example.net,001-865-478-5157,1932-04-29,Barrister
97,98,2fEc528aFAF0b69,Wesley,Bray,Male,regina11@example.org,995-542-3004x76800,1994-12-28,Police officer
98,99,Adc7ad9B6e4A1Fe,Summer,Oconnell,Female,alexiscantrell@example.org,001-273-685-6932x092,2012-04-12,Broadcast journalist
99,100,b8D0aD3490FC7e1,Mariah,Bernard,Male,pcopeland@example.org,(341)594-6554x44657,2016-11-15,IT sales professional

In [23]:
df.shape

(100, 9)

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Index          100 non-null    int64
 1   User Id        100 non-null    object
 2   First Name     100 non-null    object
 3   Last Name      100 non-null    object
 4   Sex            100 non-null    object
 5   Email          100 non-null    object
 6   Phone          100 non-null    object
 7   Date of birth  100 non-null    object
 8   Job Title      100 non-null    object
dtypes: int64(1), object(8)
memory usage: 7.2+ KB

In [25]:
df.describe(include="all")

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
count,100.000000,100,100,100,100,100,100,100,100
unique,NaN,100,94,95,2,100,100,100,91
top,NaN,88F7B33d2bcf9f5,Isaiah,Andrews,Female,elijah57@example.net,001-084-906-7849x73518,1945-10-26,"Biochemist, clinical"
freq,NaN,1,2,3,53,1,1,1,3
mean,50.500000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,29.011492,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,1.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,25.750000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,50.500000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,75.250000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,100.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [26]:
df.duplicated().sum()

np.int64(0)

In [27]:
df = df.drop(columns=["Index"], errors="ignore")

df = df.rename(columns={
    "User Id": "user_id",
    "First Name": "first_name",
    "Last Name": "last_name",
    "Sex": "gender",
    "Email": "email",
    "Phone": "phone",
    "Date of birth": "dob",
    "Job Title": "job_title"
})

df.head()

,user_id,first_name,last_name,gender,email,phone,dob,job_title
0,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
1,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,214.112.6044x4913,1910-03-24,Phytotherapist
2,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath
3,A31Bee3c201ef58,Yesenia,Martinez,Male,kaitlinkaiser@example.com,584.094.6111,2017-08-03,Market researcher
4,1bA7A3dc874da3c,Lori,Todd,Male,buchananmanuel@example.net,689-207-3558x7233,1938-12-01,Veterinary surgeon

In [28]:
df.isna().sum()

user_id       0
first_name    0
last_name     0
gender        0
email         0
phone         0
dob           0
job_title     0
dtype: int64

In [29]:
(df == "").sum()

user_id       0
first_name    0
last_name     0
gender        0
email         0
phone         0
dob           0
job_title     0
dtype: int64

In [30]:
df.apply(lambda col: col.str.isspace().sum() if col.dtype=="object" else 0)

user_id       0
first_name    0
last_name     0
gender        0
email         0
phone         0
dob           0
job_title     0
dtype: int64

In [31]:
df["dob"] = pd.to_datetime(df["dob"], errors="coerce")

df[["dob"]].head()

         dob
0 1945-10-26
1 1910-03-24
2 1992-07-02
3 2017-08-03
4 1938-12-01

In [32]:
df["dob"].isna().sum()

np.int64(0)

In [33]:
# Convert to string, remove all non-digit characters
df["phone"] = df["phone"].astype(str).str.replace(r"\D", "", regex=True)

df["phone"].head()

0    001084906784973518
1        21411260444913
2            2776097938
3            5840946111
4        68920735587233
Name: phone, dtype: object

In [34]:
(df["phone"] == "").sum()

np.int64(0)

In [35]:
# Standardize name + job title formatting
text_cols = ["first_name", "last_name", "job_title"]

for col in text_cols:
    df[col] = df[col].str.strip().str.title()

# Standardize gender text
df["gender"] = df["gender"].str.strip().str.lower().replace({
    "m": "male",
    "f": "female"
})

df[["first_name", "last_name", "gender", "job_title"]].head()

  first_name last_name  gender           job_title
0     Shelby   Terrell    male     Games Developer
1    Phillip   Summers  female      Phytotherapist
2   Kristine    Travis    male           Homeopath
3    Yesenia  Martinez    male   Market Researcher
4       Lori      Todd    male  Veterinary Surgeon

In [36]:
df["user_id"].duplicated().sum()

np.int64(0)

In [37]:
df["user_id"].isna().sum()

np.int64(0)

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     100 non-null    object
 1   first_name  100 non-null    object
 2   last_name   100 non-null    object
 3   gender      100 non-null    object
 4   email       100 non-null    object
 5   phone       100 non-null    object
 6   dob         100 non-null    datetime64[ns]
 7   job_title   100 non-null    object
dtypes: datetime64[ns](1), object(7)
memory usage: 6.4+ KB

In [39]:
df.to_csv("cleaned_people_data.csv", index=False)

print("Dataset cleaned and saved successfully!")

Dataset cleaned and saved successfully!

In [41]:
df.head()

,user_id,first_name,last_name,gender,email,phone,dob,job_title
0,88F7B33d2bcf9f5,Shelby,Terrell,male,elijah57@example.net,001084906784973518,1945-10-26,Games Developer
1,f90cD3E76f1A9b9,Phillip,Summers,female,bethany14@example.com,21411260444913,1910-03-24,Phytotherapist
2,DbeAb8CcdfeFC2c,Kristine,Travis,male,bthompson@example.com,2776097938,1992-07-02,Homeopath
3,A31Bee3c201ef58,Yesenia,Martinez,male,kaitlinkaiser@example.com,5840946111,2017-08-03,Market Researcher
4,1bA7A3dc874da3c,Lori,Todd,male,buchananmanuel@example.net,68920735587233,1938-12-01,Veterinary Surgeon

In [42]:
df.sample(5)

,user_id,first_name,last_name,gender,email,phone,dob,job_title
46,f3BD2cBF7eEb6df,Danielle,Estrada,female,jvang@example.org,8903749518772,1930-07-09,"Accountant, Chartered Management"
19,88473e15D5c3cD0,Jared,Mitchell,female,jcortez@example.com,19588496781,1921-01-18,Paediatric Nurse
72,5bC87340799FBD0,Jean,Ritter,female,kristina76@example.com,9540601066,1985-08-06,Financial Trader
67,3faB1CBfEFBDdD4,Brittney,Rubio,female,corey92@example.com,5939762528,1959-12-24,"Biochemist, Clinical"
85,CB19EafEbBfF9eC,Mario,Vaughn,male,oblake@example.com,160144503912276,1990-07-08,Research Scientist (Life Sciences)